src/test/resources/requests/ET_Create_Ticket.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsse:UsernameToken>
                <wsse:Username>expresst</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">etkt0813</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:createTicketRequest xmlns:ns0="http://aots.att.com/ticket/v1">
            <ns1:WSHeader xmlns:ns1="http://cio.att.com/commonheader/v3">
                <ns1:WSContext>
                    <ns1:FromAppId>ETT_aotsCreateTicket</ns1:FromAppId>
                    <ns1:SourceIPAddress>express-ticketing-84d5594bc7-wvckz</ns1:SourceIPAddress>
                </ns1:WSContext>
            </ns1:WSHeader>
            <ns0:createTicketInput>
                <ns2:AutoUpdateable xmlns:ns2="http://tktsvc.aots.att.com/ticket">Create Ticket</ns2:AutoUpdateable>
                <ns3:ClientTicketNum xmlns:ns3="http://tktsvc.aots.att.com/ticket"></ns3:ClientTicketNum>
                <ns4:FunctionalArea xmlns:ns4="http://tktsvc.aots.att.com/ticket">GLOBAL_AM</ns4:FunctionalArea>
                <ns5:ProblemAbstract xmlns:ns5="http://tktsvc.aots.att.com/ticket">Express Ticketing: Test ticket</ns5:ProblemAbstract>
                <ns6:ReptRequestType xmlns:ns6="http://tktsvc.aots.att.com/ticket">Fault</ns6:ReptRequestType>
                <ns7:ReptSvcImpactFlag xmlns:ns7="http://tktsvc.aots.att.com/ticket">Yes</ns7:ReptSvcImpactFlag>
                <ns8:Severity xmlns:ns8="http://tktsvc.aots.att.com/ticket">1 - Critical</ns8:Severity>
                <ns9:TicketType xmlns:ns9="http://tktsvc.aots.att.com/ticket">WEB</ns9:TicketType>
                <ns10:ReportedBy xmlns:ns10="http://tktsvc.aots.att.com/ticket">Mohit Chawla</ns10:ReportedBy>
                <ns11:ReportPhone xmlns:ns11="http://tktsvc.aots.att.com/ticket">3149717000</ns11:ReportPhone>
                <ns12:NextCheckTime xmlns:ns12="http://tktsvc.aots.att.com/ticket">1630444224</ns12:NextCheckTime>
                <ns13:TicketSource xmlns:ns13="http://tktsvc.aots.att.com/ticket">ETT</ns13:TicketSource>
                <ns14:TroubleReptDescText xmlns:ns14="http://tktsvc.aots.att.com/ticket">Circuit</ns14:TroubleReptDescText>
                <ns15:ReporterEmailAddr xmlns:ns15="http://tktsvc.aots.att.com/ticket">mc9844@att.com</ns15:ReporterEmailAddr>
                <ns16:AuthTest xmlns:ns16="http://tktsvc.aots.att.com/ticket">Y</ns16:AuthTest>
                <ns17:PowerToCPE xmlns:ns17="http://tktsvc.aots.att.com/ticket">Y</ns17:PowerToCPE>
                <ns18:TroubleReptCode xmlns:ns18="http://tktsvc.aots.att.com/ticket">843</ns18:TroubleReptCode>
                <ns19:DispatchAuthorized xmlns:ns19="http://tktsvc.aots.att.com/ticket">N</ns19:DispatchAuthorized>
                <ns20:Notes xmlns:ns20="http://tktsvc.aots.att.com/ticket">This is an online ticket created by the Customer in Express Ticketing</ns20:Notes>
                <ns21:UserID xmlns:ns21="http://tktsvc.aots.att.com/ticket">ETT</ns21:UserID>
                <ns22:ValidateContactInfo xmlns:ns22="http://tktsvc.aots.att.com/ticket">Yes</ns22:ValidateContactInfo>
                <ns23:ValidateDispatchAuth xmlns:ns23="http://tktsvc.aots.att.com/ticket">Yes</ns23:ValidateDispatchAuth>
                <ns24:ValidateLCONInfo xmlns:ns24="http://tktsvc.aots.att.com/ticket">Yes</ns24:ValidateLCONInfo>
                <ns25:ValidateLocationAccessHours xmlns:ns25="http://tktsvc.aots.att.com/ticket">Yes</ns25:ValidateLocationAccessHours>
                <ns26:ValidatePowerToCPE xmlns:ns26="http://tktsvc.aots.att.com/ticket">Yes</ns26:ValidatePowerToCPE>
                <ns27:ValidateTestAuth xmlns:ns27="http://tktsvc.aots.att.com/ticket">Yes</ns27:ValidateTestAuth>
            </ns0:createTicketInput>
            <ns0:assetInput>
                <ns28:ActiveOrg xmlns:ns28="http://tktsvc.aots.att.com/ticket">US-GNMC-BVP</ns28:ActiveOrg>
                <ns29:AssetID xmlns:ns29="http://tktsvc.aots.att.com/ticket">US2858SDOCA48R</ns29:AssetID>
                <ns30:ClientName xmlns:ns30="http://tktsvc.aots.att.com/ticket">ATTSI, INFORMATION TECHNOLOGY OP</ns30:ClientName>
                <ns31:OrgGroup xmlns:ns31="http://tktsvc.aots.att.com/ticket">W52327</ns31:OrgGroup>
                <ns32:ReptSvcLineDescText xmlns:ns32="http://tktsvc.aots.att.com/ticket">BVOIP</ns32:ReptSvcLineDescText>
                <ns33:AssetType xmlns:ns33="http://tktsvc.aots.att.com/ticket">Equipment</ns33:AssetType>
                <ns34:EndUserName xmlns:ns34="http://tktsvc.aots.att.com/ticket">Mohit Chawla</ns34:EndUserName>
                <ns35:EndUserPhone xmlns:ns35="http://tktsvc.aots.att.com/ticket">3149717000</ns35:EndUserPhone>
                <ns36:LocationCountry xmlns:ns36="http://tktsvc.aots.att.com/ticket">USA</ns36:LocationCountry>
                <ns37:LocationStateProvince xmlns:ns37="http://tktsvc.aots.att.com/ticket">AZ</ns37:LocationStateProvince>
                <ns38:LocationDetailsInfoList xmlns:ns38="http://tktsvc.aots.att.com/ticket">
                    <ns38:LocationDetailsInfo>
                        <ns38:LocationContactName>Mohit Chawla</ns38:LocationContactName>
                        <ns38:LocationContactPhone>3149717000</ns38:LocationContactPhone>
                        <ns38:LocationContactEmail>mc9844@att.com</ns38:LocationContactEmail>
                        <ns38:PremiseAccessHoursInfoList>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Mon</ns38:DayOfWeek>
                                <ns38:Start>08:00</ns38:Start>
                                <ns38:End>17:00</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Tue</ns38:DayOfWeek>
                                <ns38:Start>08:00</ns38:Start>
                                <ns38:End>17:00</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Wed</ns38:DayOfWeek>
                                <ns38:Start>08:00</ns38:Start>
                                <ns38:End>17:00</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Thu</ns38:DayOfWeek>
                                <ns38:Start>08:00</ns38:Start>
                                <ns38:End>17:00</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Fri</ns38:DayOfWeek>
                                <ns38:Start>08:00</ns38:Start>
                                <ns38:End>17:00</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Sat</ns38:DayOfWeek>
                                <ns38:Start>Closed</ns38:Start>
                                <ns38:End>Closed</ns38:End>
                            </ns38:AccessHoursInfo>
                            <ns38:AccessHoursInfo>
                                <ns38:DayOfWeek>Sun</ns38:DayOfWeek>
                                <ns38:Start>Closed</ns38:Start>
                                <ns38:End>Closed</ns38:End>
                            </ns38:AccessHoursInfo>
                        </ns38:PremiseAccessHoursInfoList>
                        <ns38:LocationDetailsType>L</ns38:LocationDetailsType>
                    </ns38:LocationDetailsInfo>
                </ns38:LocationDetailsInfoList>
                <ns39:EndUserEmail xmlns:ns39="http://tktsvc.aots.att.com/ticket">mc9844@att.com</ns39:EndUserEmail>
            </ns0:assetInput>
            <ns0:createControlInput>
                <ns40:AssetLookupType xmlns:ns40="http://tktsvc.aots.att.com/ticket">BVOIP_RTR</ns40:AssetLookupType>
            </ns0:createControlInput>
        </ns0:createTicketRequest>
    </soap-env:Body>
</soap-env:Envelope>